tutorials/flow-over-heated-plate-nearest-projection-flipped/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Centers;
    locations         faceCenters;
    connectivity      false;
    patches           (interface);
    
    readData
    (
    );
    
    writeData
    (
      Heat-Flux
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes;
    locations         faceNodes;
    connectivity      true;
    patches           (interface);
    
    readData
    (
      Temperature
    );
    
    writeData
    (
    );
  };
};
